--------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  c:\ian\git\simsum/test/cscript1.log
  log type:  text
 opened on:   1 Aug 2023, 15:24:23

. 
. cscript "Simple checks on simsum" adofile simsum
--------------------------------------------------BEGIN Simple checks on simsum

-> which simsum, usesysdir
c:\ian\git\simsum\package\simsum.ado
*! version 2.0.3 Ian White 21jul2023

. set linesize 158

. 
. which simsum
c:\ian\git\simsum\package\simsum.ado
*! version 2.0.3 Ian White 21jul2023

. 
. // handling wide format
. use check, clear
(1% of H:\stata\simsum\check\check.dta)

. simsum b*, sep(se_) true(0)

Starting to process results ...

  +------------------------------------------------------------------+
  |                      Performance measure         b_1         b_2 |
  |------------------------------------------------------------------|
  |              Non-missing point estimates         100         100 |
  |------------------------------------------------------------------|
  |              Non-missing standard errors         100         100 |
  |------------------------------------------------------------------|
  |                   Bias in point estimate   -.0119478   -.0117727 |
  |------------------------------------------------------------------|
  |                   Mean of point estimate   -.0119478   -.0117727 |
  |------------------------------------------------------------------|
  |                 Empirical standard error    .2101996    .2061269 |
  |------------------------------------------------------------------|
  |  % precision gain relative to method b_1           .    3.990678 |
  |------------------------------------------------------------------|
  |                       Mean squared error    .0438848     .042202 |
  |------------------------------------------------------------------|
  |                  Root mean squared error    .2094869    .2054313 |
  |------------------------------------------------------------------|
  |           RMS model-based standard error    .2058237    .2016575 |
  |------------------------------------------------------------------|
  |                Mean conf. interval width    .8047793    .7886414 |
  |------------------------------------------------------------------|
  |       Relative % error in standard error   -2.081764   -2.168266 |
  |------------------------------------------------------------------|
  | % coverage of nominal 95% conf. interval          92          92 |
  |------------------------------------------------------------------|
  |                 % power of 5% level test           8           8 |
  +------------------------------------------------------------------+

. 
. // handling ref() in wide format
. simsum b*, sep(se_) true(0) ref(b_2)

Starting to process results ...

  +------------------------------------------------------------------+
  |                      Performance measure         b_1         b_2 |
  |------------------------------------------------------------------|
  |              Non-missing point estimates         100         100 |
  |------------------------------------------------------------------|
  |              Non-missing standard errors         100         100 |
  |------------------------------------------------------------------|
  |                   Bias in point estimate   -.0119478   -.0117727 |
  |------------------------------------------------------------------|
  |                   Mean of point estimate   -.0119478   -.0117727 |
  |------------------------------------------------------------------|
  |                 Empirical standard error    .2101996    .2061269 |
  |------------------------------------------------------------------|
  |  % precision gain relative to method b_2   -3.837534           . |
  |------------------------------------------------------------------|
  |                       Mean squared error    .0438848     .042202 |
  |------------------------------------------------------------------|
  |                  Root mean squared error    .2094869    .2054313 |
  |------------------------------------------------------------------|
  |           RMS model-based standard error    .2058237    .2016575 |
  |------------------------------------------------------------------|
  |                Mean conf. interval width    .8047793    .7886414 |
  |------------------------------------------------------------------|
  |       Relative % error in standard error   -2.081764   -2.168266 |
  |------------------------------------------------------------------|
  | % coverage of nominal 95% conf. interval          92          92 |
  |------------------------------------------------------------------|
  |                 % power of 5% level test           8           8 |
  +------------------------------------------------------------------+

. 
. // handling mcse
. simsum b*, sep(se_) true(0) mcse

Starting to process results ...

  +----------------------------------------------------------------------------------------+
  |                      Performance measure         b_1     (MCse)         b_2     (MCse) |
  |----------------------------------------------------------------------------------------|
  |              Non-missing point estimates         100          .         100          . |
  |----------------------------------------------------------------------------------------|
  |              Non-missing standard errors         100          .         100          . |
  |----------------------------------------------------------------------------------------|
  |                   Bias in point estimate   -.0119478     .02102   -.0117727   .0206127 |
  |----------------------------------------------------------------------------------------|
  |                   Mean of point estimate   -.0119478     .02102   -.0117727   .0206127 |
  |----------------------------------------------------------------------------------------|
  |                 Empirical standard error    .2101996   .0149382    .2061269   .0146488 |
  |----------------------------------------------------------------------------------------|
  |  % precision gain relative to method b_1           .          .    3.990678   .1219183 |
  |----------------------------------------------------------------------------------------|
  |                       Mean squared error    .0438848   .0070259     .042202   .0067567 |
  |----------------------------------------------------------------------------------------|
  |                  Root mean squared error    .2094869   .0167692    .2054313   .0164451 |
  |----------------------------------------------------------------------------------------|
  |           RMS model-based standard error    .2058237   .0014974    .2016575   .0014092 |
  |----------------------------------------------------------------------------------------|
  |                Mean conf. interval width    .8047793   .0057556    .7886414   .0054198 |
  |----------------------------------------------------------------------------------------|
  |       Relative % error in standard error   -2.081764   6.995112   -2.168266    6.98613 |
  |----------------------------------------------------------------------------------------|
  | % coverage of nominal 95% conf. interval          92   2.712932          92   2.712932 |
  |----------------------------------------------------------------------------------------|
  |                 % power of 5% level test           8   2.712932           8   2.712932 |
  +----------------------------------------------------------------------------------------+

. 
. // handling se
. simsum b*, se(se*) true(0) mcse

Starting to process results ...

  +----------------------------------------------------------------------------------------+
  |                      Performance measure         b_1     (MCse)         b_2     (MCse) |
  |----------------------------------------------------------------------------------------|
  |              Non-missing point estimates         100          .         100          . |
  |----------------------------------------------------------------------------------------|
  |              Non-missing standard errors         100          .         100          . |
  |----------------------------------------------------------------------------------------|
  |                   Bias in point estimate   -.0119478     .02102   -.0117727   .0206127 |
  |----------------------------------------------------------------------------------------|
  |                   Mean of point estimate   -.0119478     .02102   -.0117727   .0206127 |
  |----------------------------------------------------------------------------------------|
  |                 Empirical standard error    .2101996   .0149382    .2061269   .0146488 |
  |----------------------------------------------------------------------------------------|
  |  % precision gain relative to method b_1           .          .    3.990678   .1219183 |
  |----------------------------------------------------------------------------------------|
  |                       Mean squared error    .0438848   .0070259     .042202   .0067567 |
  |----------------------------------------------------------------------------------------|
  |                  Root mean squared error    .2094869   .0167692    .2054313   .0164451 |
  |----------------------------------------------------------------------------------------|
  |           RMS model-based standard error    .2058237   .0014974    .2016575   .0014092 |
  |----------------------------------------------------------------------------------------|
  |                Mean conf. interval width    .8047793   .0057556    .7886414   .0054198 |
  |----------------------------------------------------------------------------------------|
  |       Relative % error in standard error   -2.081764   6.995112   -2.168266    6.98613 |
  |----------------------------------------------------------------------------------------|
  | % coverage of nominal 95% conf. interval          92   2.712932          92   2.712932 |
  |----------------------------------------------------------------------------------------|
  |                 % power of 5% level test           8   2.712932           8   2.712932 |
  +----------------------------------------------------------------------------------------+

. 
. // handling df
. simsum b*, sep(se_) true(0) mcse df(5)

Starting to process results ...

  +----------------------------------------------------------------------------------------+
  |                      Performance measure         b_1     (MCse)         b_2     (MCse) |
  |----------------------------------------------------------------------------------------|
  |              Non-missing point estimates         100          .         100          . |
  |----------------------------------------------------------------------------------------|
  |              Non-missing standard errors         100          .         100          . |
  |----------------------------------------------------------------------------------------|
  |                   Bias in point estimate   -.0119478     .02102   -.0117727   .0206127 |
  |----------------------------------------------------------------------------------------|
  |                   Mean of point estimate   -.0119478     .02102   -.0117727   .0206127 |
  |----------------------------------------------------------------------------------------|
  |                 Empirical standard error    .2101996   .0149382    .2061269   .0146488 |
  |----------------------------------------------------------------------------------------|
  |  % precision gain relative to method b_1           .          .    3.990678   .1219183 |
  |----------------------------------------------------------------------------------------|
  |                       Mean squared error    .0438848   .0070259     .042202   .0067567 |
  |----------------------------------------------------------------------------------------|
  |                  Root mean squared error    .2094869   .0167692    .2054313   .0164451 |
  |----------------------------------------------------------------------------------------|
  |           RMS model-based standard error    .2058237   .0014974    .2016575   .0014092 |
  |----------------------------------------------------------------------------------------|
  |                Mean conf. interval width    1.055505   .0075487    1.034339   .0071084 |
  |----------------------------------------------------------------------------------------|
  |       Relative % error in standard error   -2.081764   6.995112   -2.168266    6.98613 |
  |----------------------------------------------------------------------------------------|
  | % coverage of nominal 95% conf. interval          99   .9949874          98        1.4 |
  |----------------------------------------------------------------------------------------|
  |                 % power of 5% level test           1   .9949874           2        1.4 |
  +----------------------------------------------------------------------------------------+

. gen dfvar=5

. simsum b*, sep(se_) true(0) mcse df(dfvar)

Starting to process results ...

  +----------------------------------------------------------------------------------------+
  |                      Performance measure         b_1     (MCse)         b_2     (MCse) |
  |----------------------------------------------------------------------------------------|
  |              Non-missing point estimates         100          .         100          . |
  |----------------------------------------------------------------------------------------|
  |              Non-missing standard errors         100          .         100          . |
  |----------------------------------------------------------------------------------------|
  |                   Bias in point estimate   -.0119478     .02102   -.0117727   .0206127 |
  |----------------------------------------------------------------------------------------|
  |                   Mean of point estimate   -.0119478     .02102   -.0117727   .0206127 |
  |----------------------------------------------------------------------------------------|
  |                 Empirical standard error    .2101996   .0149382    .2061269   .0146488 |
  |----------------------------------------------------------------------------------------|
  |  % precision gain relative to method b_1           .          .    3.990678   .1219183 |
  |----------------------------------------------------------------------------------------|
  |                       Mean squared error    .0438848   .0070259     .042202   .0067567 |
  |----------------------------------------------------------------------------------------|
  |                  Root mean squared error    .2094869   .0167692    .2054313   .0164451 |
  |----------------------------------------------------------------------------------------|
  |           RMS model-based standard error    .2058237   .0014974    .2016575   .0014092 |
  |----------------------------------------------------------------------------------------|
  |                Mean conf. interval width    1.055505   .0075487    1.034339   .0071084 |
  |----------------------------------------------------------------------------------------|
  |       Relative % error in standard error   -2.081764   6.995112   -2.168266    6.98613 |
  |----------------------------------------------------------------------------------------|
  | % coverage of nominal 95% conf. interval          99   .9949874          98        1.4 |
  |----------------------------------------------------------------------------------------|
  |                 % power of 5% level test           1   .9949874           2        1.4 |
  +----------------------------------------------------------------------------------------+

. 
. // handling awkward variables
. gen bias_1=0

. simsum b_*, sep(se_) true(0) 

Starting to process results ...

  +------------------------------------------------------------------+
  |                      Performance measure         b_1         b_2 |
  |------------------------------------------------------------------|
  |              Non-missing point estimates         100         100 |
  |------------------------------------------------------------------|
  |              Non-missing standard errors         100         100 |
  |------------------------------------------------------------------|
  |                   Bias in point estimate   -.0119478   -.0117727 |
  |------------------------------------------------------------------|
  |                   Mean of point estimate   -.0119478   -.0117727 |
  |------------------------------------------------------------------|
  |                 Empirical standard error    .2101996    .2061269 |
  |------------------------------------------------------------------|
  |  % precision gain relative to method b_1           .    3.990678 |
  |------------------------------------------------------------------|
  |                       Mean squared error    .0438848     .042202 |
  |------------------------------------------------------------------|
  |                  Root mean squared error    .2094869    .2054313 |
  |------------------------------------------------------------------|
  |           RMS model-based standard error    .2058237    .2016575 |
  |------------------------------------------------------------------|
  |                Mean conf. interval width    .8047793    .7886414 |
  |------------------------------------------------------------------|
  |       Relative % error in standard error   -2.081764   -2.168266 |
  |------------------------------------------------------------------|
  | % coverage of nominal 95% conf. interval          92          92 |
  |------------------------------------------------------------------|
  |                 % power of 5% level test           8           8 |
  +------------------------------------------------------------------+

. 
. // handling long format
. use ppsim1, clear
(10% of H:\missing\MI\ICE\perfpred\basicdata\varys\ppsim1_postfile.dta)

. keep i method b1 seb1

. simsum b1, sep(se) method(method) id(i) true(1)  
Reshaping data to wide format ...

Starting to process results ...

  +-------------------------------------------------------------------------------------------+
  |                         Performance measure    augment        boot   penalise      zallow |
  |-------------------------------------------------------------------------------------------|
  |                 Non-missing point estimates        100         100        100         100 |
  |-------------------------------------------------------------------------------------------|
  |                 Non-missing standard errors        100         100        100         100 |
  |-------------------------------------------------------------------------------------------|
  |                      Bias in point estimate   .0083703    .0649953   .0472524   -.1835248 |
  |-------------------------------------------------------------------------------------------|
  |                      Mean of point estimate    1.00837    1.064995   1.047252    .8164752 |
  |-------------------------------------------------------------------------------------------|
  |                    Empirical standard error   .3809837    .4063731   .3949197    .3384659 |
  |-------------------------------------------------------------------------------------------|
  | % precision gain relative to method augment          .   -12.10527   -6.93309    26.70183 |
  |-------------------------------------------------------------------------------------------|
  |                          Mean squared error   .1437671    .1677121   .1566347     .147095 |
  |-------------------------------------------------------------------------------------------|
  |                     Root mean squared error   .3791664    .4095267   .3957711    .3835296 |
  |-------------------------------------------------------------------------------------------|
  |              RMS model-based standard error   .4369234    .4273399    .430112     .534929 |
  |-------------------------------------------------------------------------------------------|
  |                   Mean conf. interval width   1.688652    1.662533    1.67062    2.020274 |
  |-------------------------------------------------------------------------------------------|
  |          Relative % error in standard error   14.68295    5.159487   8.911258    58.04515 |
  |-------------------------------------------------------------------------------------------|
  |    % coverage of nominal 95% conf. interval         95          96         94          96 |
  |-------------------------------------------------------------------------------------------|
  |                    % power of 5% level test         70          71         73          27 |
  +-------------------------------------------------------------------------------------------+

. 
. // handling extra variables
. use ppsim1, clear
(10% of H:\missing\MI\ICE\perfpred\basicdata\varys\ppsim1_postfile.dta)

. simsum b1, sep(se) method(method) id(i) true(1)  
Reshaping data to wide format ...

Starting to process results ...

  +-------------------------------------------------------------------------------------------+
  |                         Performance measure    augment        boot   penalise      zallow |
  |-------------------------------------------------------------------------------------------|
  |                 Non-missing point estimates        100         100        100         100 |
  |-------------------------------------------------------------------------------------------|
  |                 Non-missing standard errors        100         100        100         100 |
  |-------------------------------------------------------------------------------------------|
  |                      Bias in point estimate   .0083703    .0649953   .0472524   -.1835248 |
  |-------------------------------------------------------------------------------------------|
  |                      Mean of point estimate    1.00837    1.064995   1.047252    .8164752 |
  |-------------------------------------------------------------------------------------------|
  |                    Empirical standard error   .3809837    .4063731   .3949197    .3384659 |
  |-------------------------------------------------------------------------------------------|
  | % precision gain relative to method augment          .   -12.10527   -6.93309    26.70183 |
  |-------------------------------------------------------------------------------------------|
  |                          Mean squared error   .1437671    .1677121   .1566347     .147095 |
  |-------------------------------------------------------------------------------------------|
  |                     Root mean squared error   .3791664    .4095267   .3957711    .3835296 |
  |-------------------------------------------------------------------------------------------|
  |              RMS model-based standard error   .4369234    .4273399    .430112     .534929 |
  |-------------------------------------------------------------------------------------------|
  |                   Mean conf. interval width   1.688652    1.662533    1.67062    2.020274 |
  |-------------------------------------------------------------------------------------------|
  |          Relative % error in standard error   14.68295    5.159487   8.911258    58.04515 |
  |-------------------------------------------------------------------------------------------|
  |    % coverage of nominal 95% conf. interval         95          96         94          96 |
  |-------------------------------------------------------------------------------------------|
  |                    % power of 5% level test         70          71         73          27 |
  +-------------------------------------------------------------------------------------------+

. 
. // handling ref() in long format
. use ppsim1, clear
(10% of H:\missing\MI\ICE\perfpred\basicdata\varys\ppsim1_postfile.dta)

. simsum b1, sep(se) method(method) id(i) true(1) ref(boot)
Reshaping data to wide format ...

Starting to process results ...

  +---------------------------------------------------------------------------------------+
  |                      Performance measure    augment       boot   penalise      zallow |
  |---------------------------------------------------------------------------------------|
  |              Non-missing point estimates        100        100        100         100 |
  |---------------------------------------------------------------------------------------|
  |              Non-missing standard errors        100        100        100         100 |
  |---------------------------------------------------------------------------------------|
  |                   Bias in point estimate   .0083703   .0649953   .0472524   -.1835248 |
  |---------------------------------------------------------------------------------------|
  |                   Mean of point estimate    1.00837   1.064995   1.047252    .8164752 |
  |---------------------------------------------------------------------------------------|
  |                 Empirical standard error   .3809837   .4063731   .3949197    .3384659 |
  |---------------------------------------------------------------------------------------|
  | % precision gain relative to method boot   13.77247          .   5.884522     44.1518 |
  |---------------------------------------------------------------------------------------|
  |                       Mean squared error   .1437671   .1677121   .1566347     .147095 |
  |---------------------------------------------------------------------------------------|
  |                  Root mean squared error   .3791664   .4095267   .3957711    .3835296 |
  |---------------------------------------------------------------------------------------|
  |           RMS model-based standard error   .4369234   .4273399    .430112     .534929 |
  |---------------------------------------------------------------------------------------|
  |                Mean conf. interval width   1.688652   1.662533    1.67062    2.020274 |
  |---------------------------------------------------------------------------------------|
  |       Relative % error in standard error   14.68295   5.159487   8.911258    58.04515 |
  |---------------------------------------------------------------------------------------|
  | % coverage of nominal 95% conf. interval         95         96         94          96 |
  |---------------------------------------------------------------------------------------|
  |                 % power of 5% level test         70         71         73          27 |
  +---------------------------------------------------------------------------------------+

. 
. // handling df
. use ppsim1, clear
(10% of H:\missing\MI\ICE\perfpred\basicdata\varys\ppsim1_postfile.dta)

. simsum b1, sep(se) method(method) id(i) true(1) ref(boot) df(5)
Reshaping data to wide format ...

Starting to process results ...

  +---------------------------------------------------------------------------------------+
  |                      Performance measure    augment       boot   penalise      zallow |
  |---------------------------------------------------------------------------------------|
  |              Non-missing point estimates        100        100        100         100 |
  |---------------------------------------------------------------------------------------|
  |              Non-missing standard errors        100        100        100         100 |
  |---------------------------------------------------------------------------------------|
  |                   Bias in point estimate   .0083703   .0649953   .0472524   -.1835248 |
  |---------------------------------------------------------------------------------------|
  |                   Mean of point estimate    1.00837   1.064995   1.047252    .8164752 |
  |---------------------------------------------------------------------------------------|
  |                 Empirical standard error   .3809837   .4063731   .3949197    .3384659 |
  |---------------------------------------------------------------------------------------|
  | % precision gain relative to method boot   13.77247          .   5.884522     44.1518 |
  |---------------------------------------------------------------------------------------|
  |                       Mean squared error   .1437671   .1677121   .1566347     .147095 |
  |---------------------------------------------------------------------------------------|
  |                  Root mean squared error   .3791664   .4095267   .3957711    .3835296 |
  |---------------------------------------------------------------------------------------|
  |           RMS model-based standard error   .4369234   .4273399    .430112     .534929 |
  |---------------------------------------------------------------------------------------|
  |                Mean conf. interval width   2.214744   2.180488   2.191094    2.649682 |
  |---------------------------------------------------------------------------------------|
  |       Relative % error in standard error   14.68295   5.159487   8.911258    58.04515 |
  |---------------------------------------------------------------------------------------|
  | % coverage of nominal 95% conf. interval        100         98         99          98 |
  |---------------------------------------------------------------------------------------|
  |                 % power of 5% level test         44         48         45          10 |
  +---------------------------------------------------------------------------------------+

. gen df=5

. simsum b1, sep(se) method(method) id(i) true(1) ref(boot) df(df)
Reshaping data to wide format ...

Starting to process results ...

  +---------------------------------------------------------------------------------------+
  |                      Performance measure    augment       boot   penalise      zallow |
  |---------------------------------------------------------------------------------------|
  |              Non-missing point estimates        100        100        100         100 |
  |---------------------------------------------------------------------------------------|
  |              Non-missing standard errors        100        100        100         100 |
  |---------------------------------------------------------------------------------------|
  |                   Bias in point estimate   .0083703   .0649953   .0472524   -.1835248 |
  |---------------------------------------------------------------------------------------|
  |                   Mean of point estimate    1.00837   1.064995   1.047252    .8164752 |
  |---------------------------------------------------------------------------------------|
  |                 Empirical standard error   .3809837   .4063731   .3949197    .3384659 |
  |---------------------------------------------------------------------------------------|
  | % precision gain relative to method boot   13.77247          .   5.884522     44.1518 |
  |---------------------------------------------------------------------------------------|
  |                       Mean squared error   .1437671   .1677121   .1566347     .147095 |
  |---------------------------------------------------------------------------------------|
  |                  Root mean squared error   .3791664   .4095267   .3957711    .3835296 |
  |---------------------------------------------------------------------------------------|
  |           RMS model-based standard error   .4369234   .4273399    .430112     .534929 |
  |---------------------------------------------------------------------------------------|
  |                Mean conf. interval width   2.214744   2.180488   2.191094    2.649682 |
  |---------------------------------------------------------------------------------------|
  |       Relative % error in standard error   14.68295   5.159487   8.911258    58.04515 |
  |---------------------------------------------------------------------------------------|
  | % coverage of nominal 95% conf. interval        100         98         99          98 |
  |---------------------------------------------------------------------------------------|
  |                 % power of 5% level test         44         48         45          10 |
  +---------------------------------------------------------------------------------------+

. 
. log close
      name:  <unnamed>
       log:  c:\ian\git\simsum/test/cscript1.log
  log type:  text
 closed on:   1 Aug 2023, 15:24:27
--------------------------------------------------------------------------------------------------------------------------------------------------------------
